Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures Class
 Failures related to part merge operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PartMakerMethodForMergePartFailures
Public NotInheritable Class PartMakerMethodForMergePartFailures
public ref class PartMakerMethodForMergePartFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PartMakerMethodForMergePartFailures = class end
The BuiltInFailures.PartMakerMethodForMergePartFailures type exposes the following members.
Properties
Name | Description
MergedPartHasDisConnectedGeometries |  A merged part geometry has dis-connected components.
NeedTwoPartsToMerge |  Attempt to merge fewer than two parts. There must be at least two. No part will be produced.
PartNotIncludedInMerge |  This part is not geometrically coincident with another part of the same material. No merge possible.
PartsCannotBeMerged |  This PartMaker refers to parts which cannot be merged.
UnableToIncludePartInMerge |  Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.
Top
See Also
Reference
Autodesk.Revit.DB Namespace